IDEA StatiCa Open Model
OpenModel.GetObject Method
Compatible with IDEA StatiCa Beta 21.0 - beta
 Gets the Open element object from the Reference element
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public OpenElementId GetObject(
	ReferenceElement element
)
Public Function GetObject (
	element As ReferenceElement
) As OpenElementId
public:
OpenElementId^ GetObject(
	ReferenceElement^ element
)
Parameters
element
Type: IdeaRS.OpenModel.ReferenceElement
Reference element
Return Value
Type: OpenElementId
The instance of OpenElementId object
See Also
Reference
OpenModel Class
IdeaRS.OpenModel Namespace